"""開發構想

使用 customtkinter 實現, 輕量美觀的 UI
功能 與 Streamline 一致, 只是將設置 UI 化
進度也由 UI 展示

底層實現相同, 但少了打印文本, 與 增加多選功能 (UI 可以直接多選)

os 操作改用 pathlib 庫來簡化

採用模塊化實現
創建 modules
讀取數據模塊, 解析數據模塊, UI 模塊, 選擇任務後解析模塊, 任務模塊
Classification(Advanced) 這個作為主模塊, 調用所有模塊來實現

對應某些實現, 調用 utils 來實現

主要實現:

1. 文件夾選擇, 按鈕點擊
2. 可使用 ttk 實現文件拖放, 可直接拖動文件

switch check box 選擇:

1. 複製 還是 移動 (對應 Copy)
2. 完成後開啟 輸出文件 (對應 SaveOpen)
3. 輸出檔名是否要有來源路徑 (對應 AddSource)
4. 是否創建類型資料夾 (對應 CreateTypeFolder) [複選時使用 (jpg|png|webp) 之類的顯示]

其他 UI 可直接操作, 不需要實現

選擇後展示:
以表格顯示, 並且可以直接點擊 可 多選 或取消
使用主 UI 展示, 不需要開啟 額外視窗

注意問題:

輸出任務時, 因該採取守護線程, 或其他實作方式, 不應該卡住 UI, 並且由 Signal 實現, 傳遞信號
由 UI 更新進度條

"""
